app/Helpers/settings_helper.php

function settingsGet()
{
    $modelsettings = new \App\Models\SettingsModel;
    $data['settings'] = $modelsettings->first();
---
SELECT *
FROM `settings`
 LIMIT 1