app/Controllers/Anasayfa.php

SELECT *
FROM `categories`
SELECT *
FROM `products`
WHERE `is_active` = 1
---
    public function index()
    {

      $modelcategories= new \App\Models\UserModel;
      $modelproducts= new \App\Models\ProductsModel;
      $data['category']=$modelcategories->findAll();
      $data['products']=$modelproducts->where('is_active',1)->findAll();