app/Controllers/Home.php

SELECT *
FROM `categories`
SELECT *
FROM `products`
---
    public function panel()
    {
        $modelcategories = new \App\Models\UserModel;
        $modelproducts = new \App\Models\ProductsModel;
        $modelEmploye = new \App\Models\KullaniciModel;
        $data['category'] = $modelcategories->findAll();
        $data['product'] = $modelproducts->findAll();

DELETE FROM `kullanici`
WHERE `id` = '20'
---
    public function employeDelete($id)
    {
        $modelKullanici = new \App\Models\KullaniciModel;
        $data['employe'] = $modelKullanici->find($id);
        $employeDelete = $modelKullanici->where('id', $id)->delete();